#当只选择一个组时，考虑不同的边有不同的颜色，于是就有color这一回事，
#基因之间的关系不同，颜色就不同

#给边定义颜色--------------------------------
#后面应该要重新定义一下颜色才行
define_edges_color <- function(str = "1001"){
  switch(str,
         "1000" = "#003366",
         "0100" = "#003300",
         "0010" = "#993333",
         "0001" = "#9900cc",
         "1100" = "#000066",
         "1010" = "#ffff66",
         "1001" = "#66ffcc",
         "0110" = "#9966ff",
         "0101" = "#ff0066",
         "0011" = "#ffcc99",
         "1110" = "#99ccff", 
         "0111" = "#6600ff", #紫色
         "1011" = "#ff9900", #土黄色
         "1101" = "#66ffff", #亮蓝色
         "1111" = "#000000") #黑色
}

